20250806T215014--kdoc-427-スマホにdnsフィルタリングを設定して有害コンテンツをブロックする__essay.org
:properties:
:ID: 20250806T215014
:mtime:    20250904204224
:ctime:    20250806215016
:end:
#+title:      KDOC 427: スマホにDNSフィルタリングを設定して有害コンテンツをブロックする
#+date:       [2025-08-06 Wed 21:50]
#+filetags:   :essay:
#+identifier: 20250806T215014

* この文書のステータス
- 作成
  - [X] 2025-08-07 貴島
- レビュー
  - [X] 2025-09-04 貴島

* 概要

ポルノ依存対策に取り組んできた。以前、Adguardによって自宅LANに対してDNSフィルタリングを設定して、センシティブコンテンツをブロックするようにした。

- [[id:20241115T185022][KDOC 288: DNSフィルタリングで有害コンテンツをブロックする]]

自宅の全端末で、URLのブラックリストに加えて検索エンジンの強制セーフサーチを適用した。偶発的にポルノが出ない、反射的に検索して表示されない、というのは習慣の改善にとても効果があった。

しかし、意思は弱かった。スマホでWifiを切って、携帯電話回線を利用して回避し始めた。しばらく放置していたが、対策することにした。
* DNSフィルタリングサービス

スマホのフィルタリング手法にも色々あるのだが、一番手軽で確実なのはDNSフィルタリングに見える[fn:1]。自宅LANとは違って、グローバルなDNSサーバを使う必要がある。[[https://nextdns.io/][NextDNS]]というWebサービスを使うことにした。ある程度のクエリ数までは無料であり、スマホはあまり使わないのでちょうどよかった。使うだけなら会員登録すら必要なくて、スマホの「プライベートDNS」を設定するだけでいい。OSごとのガイドもちゃんと用意されている。カテゴリによるフィルタリング、各検索エンジンの強制セーフサーチがあって、要件を完全に満たしている。

またしばらく運用してみる。

* Footnotes
[fn:1] スマホは定期的に替えるイベントが発生するので、同じ設定が簡単にできるかも重要である。アプリは、その点面倒である。
* 関連

- [[id:20241115T185022][KDOC 288: DNSフィルタリングで有害コンテンツをブロックする]]。これ自体はよく機能した。しかし穴があったために目的を達成できていなかった
