20250806T215014--kdoc-427-スマホにdnsフィルタリングを設定して有害コンテンツをブロックする__essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-20T22:33:44Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 427: スマホにDNSフィルタリングを設定して有害コンテンツをブロックする</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 427: スマホにDNSフィルタリングを設定して有害コンテンツをブロックする</h1>
<div id="outline-container-org9404fc1" class="outline-2">
<h2 id="org9404fc1"><a href="#org9404fc1">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org9404fc1">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-08-07 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-09-04 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3f4d941" class="outline-2">
<h2 id="org3f4d941"><a href="#org3f4d941">概要</a></h2>
<div class="outline-text-2" id="text-org3f4d941">
<p>
ポルノ依存対策に取り組んできた。以前、Adguardによって自宅LANに対してDNSフィルタリングを設定して、センシティブコンテンツをブロックするようにした。
</p>

<ul class="org-ul">
<li><a href="20241115T185022--kdoc-288-dnsフィルタリングで有害コンテンツをブロックする__essay.html#ID-20241115T185022">KDOC 288: DNSフィルタリングで有害コンテンツをブロックする</a></li>
</ul>

<p>
自宅の全端末で、URLのブラックリストに加えて検索エンジンの強制セーフサーチを適用した。偶発的にポルノが出ない、反射的に検索して表示されない、というのは習慣の改善にとても効果があった。
</p>

<p>
しかし、意思は弱かった。スマホでWifiを切って、携帯電話回線を利用して回避し始めた。しばらく放置していたが、対策することにした。
</p>
</div>
</div>
<div id="outline-container-org085148b" class="outline-2">
<h2 id="org085148b"><a href="#org085148b">DNSフィルタリングサービス</a></h2>
<div class="outline-text-2" id="text-org085148b">
<p>
スマホのフィルタリング手法にも色々あるのだが、一番手軽で確実なのはDNSフィルタリングに見える<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>。自宅LANとは違って、グローバルなDNSサーバを使う必要がある。<a href="https://nextdns.io/">NextDNS</a>というWebサービスを使うことにした。ある程度のクエリ数までは無料であり、スマホはあまり使わないのでちょうどよかった。使うだけなら会員登録すら必要なくて、スマホの「プライベートDNS」を設定するだけでいい。OSごとのガイドもちゃんと用意されている。カテゴリによるフィルタリング、各検索エンジンの強制セーフサーチがあって、要件を完全に満たしている。
</p>

<p>
またしばらく運用してみる。
</p>
</div>
</div>
<div id="outline-container-org897d070" class="outline-2">
<h2 id="org897d070"><a href="#org897d070">関連</a></h2>
<div class="outline-text-2" id="text-org897d070">
<ul class="org-ul">
<li><a href="20241115T185022--kdoc-288-dnsフィルタリングで有害コンテンツをブロックする__essay.html#ID-20241115T185022">KDOC 288: DNSフィルタリングで有害コンテンツをブロックする</a>。これ自体はよく機能した。しかし穴があったために目的を達成できていなかった</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
スマホは定期的に替えるイベントが発生するので、同じ設定が簡単にできるかも重要である。アプリは、その点面倒である。
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
